ЕАС/src/InformationRegisters/ЕАС_ПротоколыОбмена/ЕАС_ПротоколыОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЕАС_ПротоколыОбмена</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Протокол</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПротокола</name>
    <type>
      <types>EnumRef.ЕАС_ВидыПротоколовОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбластьДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЕАС/src/InformationRegisters/ЕАС_ПротоколыОбмена/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает текстовый документ, содержащий протокол обмена.
//
Функция ПолучитьТекстПротокола(ВидПротокола, Период = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Т.Период КАК Период,
		                      |	Т.Протокол КАК Протокол
		                      |ИЗ
		                      |	РегистрСведений.ЕАС_ПротоколыОбмена.СрезПоследних(, ВидПротокола = &ВидПротокола) КАК Т");
		
	Иначе
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Т.Период КАК Период,
		                      |	Т.Протокол КАК Протокол
		                      |ИЗ
		                      |	РегистрСведений.ЕАС_ПротоколыОбмена КАК Т
		                      |ГДЕ
		                      |	Т.ВидПротокола = &ВидПротокола
		                      |	И Т.Период = &Период");
		
		Запрос.УстановитьПараметр("Период", Период);
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("ВидПротокола", ВидПротокола);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// Получим протокол в формате текстового документа
		Протокол = Выборка.Протокол.Получить();
		
		Если ТипЗнч(Протокол) <> Тип("ТекстовыйДокумент")  Тогда
			ВызватьИсключение НСтр("ru='Ошибка получения текста протокола обмена.'");
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение НСтр("ru='Протокол обмена не найден. Возможно он был удален.'");
		
	КонецЕсли;
		
	Возврат Протокол;
	
КонецФункции

#КонецОбласти

#КонецЕсли
